read_liberty sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog synth.v
link_design FFT
read_sdc cla.sdc
report_checks


